{
  "en": {
    "nav_title": "CodeReserve",
    "nav_home": "Home",
    "nav_access": "Early Access",
    "lang_toggle": "ES",

    "hero_headline": "GitHub is drowning in AI slop.",
    "hero_subline_1": "LLMs generate infinite code. You have one pair of eyes.\nYour inbox is already lost. We built a protocol to fix it.",
    "hero_promise": "",
    "hero_cta_maintainers": "Early Access - Maintainers (Limited)",
    "hero_cta_contributors": "Early Access - Contributors",

    "problem_title": "The Reality",
    "problem_text": "Maintainers are burnt out.\nYour repo is getting spammed by mass-prompting agents and devs who can't read error messages.\nFiltering garbage is unpaid labor.\n\nIf this continues, maintainers will quit and critical infrastructure will rot. Remember left-pad? That guy wasn't getting paid either.",

    "solution_title": "The Mechanism",
    "solution_text": "We introduce Economic Friction to Pull Requests.\n\nThe Bouncer (Bot): We wrap your repo. PR opened without a deposit? Auto-closed. Instantly.\nThe Stake: Contributors lock USDC/ETH to open a PR.\nValid Code: 100% returned.\nAccepted Code: Returned + Bounty.\nSpam: Slashed. Goes to the repo treasury for future bounties.\n\nResult: Spam drops to zero. Only devs who trust their code put money on the table.\n\n---\n\nFOR MAINTAINERS\nStop reviewing garbage.\nInstall the GitHub App. Link a wallet. Done.\nThe market filters the noise. You keep full control over what gets merged. We just clean your inbox.\n\nFOR CONTRIBUTORS\nStop working for internet points.\nBuild a cryptographic resume (SBTs) that proves you ship.\nEarn real money for solving real problems.\nIf you're good, this costs you nothing. If you're a bot, you go broke.\n\nFOR COMPANIES\nYour dependencies are ticking time bombs maintained by burned-out volunteers.\nStop donating blindly to foundations.\nFund the Treasury: Send funds directly to a project's smart contract.\nVote on Roadmap: Your money, your vote on which issues get priority.\nIf you pay for it, it gets built.",
    "solution_maintainers_title": "For Maintainers",

    "status_title": "Status",
    "status_text": "Building MVP.\n\nCurrently focused on:\n→ Solidity Escrow Contracts\n→ The GitHub Bouncer Bot\n\nMaintain a repo with >500 stars and hate your notifications? Email us.\nWant to fund development? Email us.",

    "social_proof_title": "Early Partners",
    "social_proof_text": "In talks with maintainers of projects totaling 50k+ stars.",
    "social_proof_cta": "Maintain a project with 1000+ stars? You get priority. Get in touch.",

    "faq_title": "FAQ",
    "faq_q1": "Doesn't this already exist? (Tea.xyz, Gitcoin...)",
    "faq_a1": "Yes. Their incentives are broken.\n\nTea.xyz: Pays \"royalties\" based on dependency graphs. This incentivizes uploading AI-generated garbage to farm tokens. They add noise; we remove it. Our staking model makes spam financially painful.\n\nGitcoin: Charity. You rely on goodwill and quarterly funding rounds. We're a labor market: fix the bug, pass validation, get paid instantly. No donations. Results.",
    "faq_q2": "Why Blockchain?",
    "faq_a2": "Stripe doesn't do escrow logic, programmable treasuries, or permissionless reputation. We use crypto as backend infrastructure. You don't need to care about \"the community\" or \"the vibes\".",
    "faq_q3": "Is this pay-to-play?",
    "faq_a3": "Stake-to-play. Costs $0 if you're competent. Costs money if you waste our time.",
    "faq_q4": "Who runs this?",
    "faq_a4": "One dev building the MVP. Goal: decentralized protocol governed by the nodes doing the work.",

    "contact_title": "Want In?",
    "contact_instructions": "Email dohkku@codereserve.org with:",
    "contact_info_role": "Who you are (maintainer / contributor / company)",
    "contact_info_github": "Your GitHub profile or repo",
    "contact_info_interest": "Why you care",

    "footer_copyright": "© 2026 CodeReserve.",
    "footer_links": "Privacy • Terms • GitHub"
  },
  "es": {
    "nav_title": "CodeReserve",
    "nav_home": "Inicio",
    "nav_access": "Acceso Anticipado",
    "lang_toggle": "EN",

    "hero_headline": "GitHub está inundado de basura generada por IA.",
    "hero_subline_1": "Los LLMs generan código infinito. Tú tienes dos ojos.\nTu bandeja de entrada ya está perdida. Construimos un protocolo para arreglarlo.",
    "hero_promise": "",
    "hero_cta_maintainers": "Acceso Anticipado - Maintainers (Limitado)",
    "hero_cta_contributors": "Acceso Anticipado - Contributors",

    "problem_title": "La Realidad",
    "problem_text": "Los maintainers están quemados.\nTu repo está siendo bombardeado por agentes automatizados y devs que no saben leer un stack trace.\nFiltrar basura es trabajo gratis.\n\nSi esto sigue, los maintainers van a abandonar y la infraestructura crítica se va a pudrir. ¿Te acuerdas de left-pad? Ese tipo tampoco cobraba.",

    "solution_title": "El Mecanismo",
    "solution_text": "Introducimos Fricción Económica a los Pull Requests.\n\nEl Bouncer (Bot): Envolvemos tu repo. ¿PR sin depósito? Cerrado automáticamente. Al instante.\nEl Stake: Los contributors depositan USDC/ETH para abrir un PR.\nCódigo Válido: 100% devuelto.\nCódigo Aceptado: Devuelto + Bounty.\nSpam: Confiscado. Va a la tesorería del repo para futuras recompensas.\n\nResultado: El spam cae a cero. Solo los devs que confían en su código ponen dinero sobre la mesa.\n\n---\n\nPARA MAINTAINERS\nDeja de revisar basura.\nInstala la GitHub App. Conecta una wallet. Listo.\nEl mercado filtra el ruido. Tú mantienes control total sobre qué se mergea. Nosotros solo limpiamos tu inbox.\n\nPARA CONTRIBUTORS\nDeja de trabajar por puntos de internet.\nConstruye un currículum criptográfico (SBTs) que demuestra que shipeas.\nGana dinero real por resolver problemas reales.\nSi eres bueno, esto te cuesta cero. Si eres un bot, te arruinas.\n\nPARA EMPRESAS\nTus dependencias son bombas de tiempo mantenidas por voluntarios quemados.\nDeja de donar a ciegas a fundaciones.\nFinancia la Tesorería: Manda fondos directo al smart contract del proyecto.\nVota el Roadmap: Tu dinero, tu voto sobre qué issues tienen prioridad.\nSi lo pagas, se construye.",
    "solution_maintainers_title": "Para Maintainers",

    "status_title": "Estado",
    "status_text": "Construyendo el MVP.\n\nAhora mismo enfocados en:\n→ Contratos de Escrow en Solidity\n→ El Bot Bouncer de GitHub\n\n¿Mantienes un repo con >500 estrellas y odias tus notificaciones? Escríbenos.\n¿Quieres financiar el desarrollo? Escríbenos.",

    "social_proof_title": "Partners Iniciales",
    "social_proof_text": "En conversaciones con maintainers de proyectos que suman +50k estrellas.",
    "social_proof_cta": "¿Mantienes un proyecto con +1000 estrellas? Tienes prioridad. Escríbenos.",

    "faq_title": "FAQ",
    "faq_q1": "¿Esto no existe ya? (Tea.xyz, Gitcoin...)",
    "faq_a1": "Sí. Sus incentivos están rotos.\n\nTea.xyz: Paga \"regalías\" basadas en grafos de dependencias. Esto incentiva subir basura generada por IA para farmear tokens. Ellos añaden ruido; nosotros lo eliminamos. Nuestro modelo de staking hace que el spam sea financieramente doloroso.\n\nGitcoin: Caridad. Dependes de buena voluntad y rondas de funding trimestrales. Nosotros somos un mercado laboral: arreglas el bug, pasas validación, cobras al instante. Sin donaciones. Resultados.",
    "faq_q2": "¿Por qué Blockchain?",
    "faq_a2": "Stripe no hace lógica de escrow, tesorerías programables ni reputación permissionless. Usamos crypto como infraestructura de backend. No te tiene que importar \"la comunidad\" ni \"las vibes\".",
    "faq_q3": "¿Es pay-to-play?",
    "faq_a3": "Stake-to-play. Te cuesta $0 si eres competente. Te cuesta dinero si nos haces perder el tiempo.",
    "faq_q4": "¿Quién está detrás?",
    "faq_a4": "Un dev construyendo el MVP. Objetivo: protocolo descentralizado gobernado por los nodos que hacen el trabajo.",

    "contact_title": "¿Quieres entrar?",
    "contact_instructions": "Email a dohkku@codereserve.org con:",
    "contact_info_role": "Quién eres (maintainer / contributor / empresa)",
    "contact_info_github": "Tu perfil de GitHub o repo",
    "contact_info_interest": "Por qué te interesa",

    "footer_copyright": "© 2026 CodeReserve.",
    "footer_links": "Privacidad • Términos • GitHub"
  }
}
